Ran Plan for dir: `terragrunt/kubernetes/authentik` workspace: `terragrunt_kubernetes_authentik`

<details><summary>Show Output</summary>

```diff
Authenticated

01:00:56.904 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/B9wA20iwsjM9OKc2oE6aqNuxBEU/u-v0V2yODMtkUZqZRgranKTrlZg
01:00:56.927 INFO   tofu: Initializing the backend...
01:00:57.195 INFO   tofu: Initializing provider plugins...
01:00:57.195 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:00:57.398 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:00:57.542 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:00:57.696 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:00:57.840 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:00:58.003 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:00:58.128 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:00:58.245 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:00:58.377 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:00:58.409 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:00:58.444 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:00:58.464 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
01:00:58.499 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:00:58.514 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:00:58.588 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:00:58.608 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:00:58.608 INFO   tofu: OpenTofu has been successfully initialized!
01:00:59.503 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:00:59.503 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:00:59.503 STDOUT tofu:   ~ update in-place
01:00:59.503 STDOUT tofu: OpenTofu will perform the following actions:
01:00:59.503 STDOUT tofu:   # helm_release.authentik will be updated in-place
01:00:59.503 STDOUT tofu:   ~ resource "helm_release" "authentik" {
01:00:59.503 STDOUT tofu:       ~ id                         = "authentik" -> (known after apply)
01:00:59.503 STDOUT tofu:       ~ metadata                   = {
01:00:59.503 STDOUT tofu:           ~ app_version    = "2025.6.1" -> (known after apply)
01:00:59.503 STDOUT tofu:           ~ chart          = "authentik" -> (known after apply)
01:00:59.503 STDOUT tofu:           ~ first_deployed = 1747009449 -> (known after apply)
01:00:59.503 STDOUT tofu:           ~ last_deployed  = 1749778368 -> (known after apply)
01:00:59.504 STDOUT tofu:           ~ name           = "authentik" -> (known after apply)
01:00:59.504 STDOUT tofu:           ~ namespace      = "authentik" -> (known after apply)
01:00:59.504 STDOUT tofu:           ~ revision       = 4 -> (known after apply)
01:00:59.504 STDOUT tofu:           ~ values         = jsonencode(
01:00:59.504 STDOUT tofu:                 {
01:00:59.504 STDOUT tofu:                   - authentik  = {
01:00:59.504 STDOUT tofu:                       - bootstrap_email = "youri@youhide.com.br"
01:00:59.504 STDOUT tofu:                       - email           = {
01:00:59.504 STDOUT tofu:                           - from     = "Authentik <postmaster@mg.tkasolutions.com.br>"
01:00:59.504 STDOUT tofu:                           - host     = "smtp.mailgun.org"
01:00:59.504 STDOUT tofu:                           - port     = 587
01:00:59.504 STDOUT tofu:                           - use_tls  = true
01:00:59.504 STDOUT tofu:                           - username = "postmaster@mg.tkasolutions.com.br"
01:00:59.504 STDOUT tofu:                         }
01:00:59.504 STDOUT tofu:                     }
01:00:59.504 STDOUT tofu:                   - global     = {
01:00:59.504 STDOUT tofu:                       - env = [
01:00:59.504 STDOUT tofu:                           - {
01:00:59.504 STDOUT tofu:                               - name      = "AUTHENTIK_SECRET_KEY"
01:00:59.504 STDOUT tofu:                               - valueFrom = {
01:00:59.504 STDOUT tofu:                                   - secretKeyRef = {
01:00:59.504 STDOUT tofu:                                       - key  = "authentik-secret-key"
01:00:59.504 STDOUT tofu:                                       - name = "authentik-secrets"
01:00:59.504 STDOUT tofu:                                     }
01:00:59.504 STDOUT tofu:                                 }
01:00:59.504 STDOUT tofu:                             },
01:00:59.504 STDOUT tofu:                           - {
01:00:59.504 STDOUT tofu:                               - name      = "AUTHENTIK_EMAIL__PASSWORD"
01:00:59.504 STDOUT tofu:                               - valueFrom = {
01:00:59.504 STDOUT tofu:                                   - secretKeyRef = {
01:00:59.504 STDOUT tofu:                                       - key  = "smtp-password"
01:00:59.504 STDOUT tofu:                                       - name = "authentik-secrets"
01:00:59.504 STDOUT tofu:                                     }
01:00:59.504 STDOUT tofu:                                 }
01:00:59.504 STDOUT tofu:                             },
01:00:59.504 STDOUT tofu:                           - {
01:00:59.504 STDOUT tofu:                               - name      = "AUTHENTIK_BOOTSTRAP_PASSWORD"
01:00:59.504 STDOUT tofu:                               - valueFrom = {
01:00:59.504 STDOUT tofu:                                   - secretKeyRef = {
01:00:59.504 STDOUT tofu:                                       - key  = "token"
01:00:59.504 STDOUT tofu:                                       - name = "authentik-secrets"
01:00:59.504 STDOUT tofu:                                     }
01:00:59.504 STDOUT tofu:                                 }
01:00:59.504 STDOUT tofu:                             },
01:00:59.504 STDOUT tofu:                           - {
01:00:59.504 STDOUT tofu:                               - name      = "AUTHENTIK_BOOTSTRAP_TOKEN"
01:00:59.504 STDOUT tofu:                               - valueFrom = {
01:00:59.504 STDOUT tofu:                                   - secretKeyRef = {
01:00:59.505 STDOUT tofu:                                       - key  = "token"
01:00:59.505 STDOUT tofu:                                       - name = "authentik-secrets"
01:00:59.505 STDOUT tofu:                                     }
01:00:59.505 STDOUT tofu:                                 }
01:00:59.505 STDOUT tofu:                             },
01:00:59.505 STDOUT tofu:                           - {
01:00:59.505 STDOUT tofu:                               - name      = "POSTGRES_PASSWORD"
01:00:59.505 STDOUT tofu:                               - valueFrom = {
01:00:59.505 STDOUT tofu:                                   - secretKeyRef = {
01:00:59.505 STDOUT tofu:                                       - key  = "postgresql-password"
01:00:59.505 STDOUT tofu:                                       - name = "authentik-secrets"
01:00:59.505 STDOUT tofu:                                     }
01:00:59.505 STDOUT tofu:                                 }
01:00:59.505 STDOUT tofu:                             },
01:00:59.505 STDOUT tofu:                         ]
01:00:59.505 STDOUT tofu:                     }
01:00:59.505 STDOUT tofu:                   - postgresql = {
01:00:59.505 STDOUT tofu:                       - auth    = {
01:00:59.505 STDOUT tofu:                           - existingSecret = "authentik-secrets"
01:00:59.505 STDOUT tofu:                           - secretKeys     = {
01:00:59.505 STDOUT tofu:                               - userPasswordKey = "postgresql-password"
01:00:59.505 STDOUT tofu:                             }
01:00:59.505 STDOUT tofu:                         }
01:00:59.505 STDOUT tofu:                       - enabled = true
01:00:59.505 STDOUT tofu:                       - primary = {
01:00:59.505 STDOUT tofu:                           - persistence = {
01:00:59.505 STDOUT tofu:                               - accessModes  = [
01:00:59.505 STDOUT tofu:                                   - "ReadWriteOnce",
01:00:59.505 STDOUT tofu:                                 ]
01:00:59.505 STDOUT tofu:                               - size         = "4Gi"
01:00:59.505 STDOUT tofu:                               - storageClass = "longhorn"
01:00:59.505 STDOUT tofu:                               - volumeName   = "authentik-postgres-volume"
01:00:59.505 STDOUT tofu:                             }
01:00:59.505 STDOUT tofu:                         }
01:00:59.505 STDOUT tofu:                     }
01:00:59.505 STDOUT tofu:                   - redis      = {
01:00:59.505 STDOUT tofu:                       - enabled = true
01:00:59.505 STDOUT tofu:                       - master  = {
01:00:59.505 STDOUT tofu:                           - persistence = {
01:00:59.505 STDOUT tofu:                               - accessModes  = [
01:00:59.505 STDOUT tofu:                                   - "ReadWriteOnce",
01:00:59.505 STDOUT tofu:                                 ]
01:00:59.505 STDOUT tofu:                               - size         = "2Gi"
01:00:59.505 STDOUT tofu:                               - storageClass = "longhorn"
01:00:59.505 STDOUT tofu:                               - volumeName   = "authentik-redis-volume"
01:00:59.505 STDOUT tofu:                             }
01:00:59.505 STDOUT tofu:                         }
01:00:59.505 STDOUT tofu:                     }
01:00:59.505 STDOUT tofu:                   - server     = {
01:00:59.505 STDOUT tofu:                       - ingress = {
01:00:59.505 STDOUT tofu:                           - enabled          = true
01:00:59.505 STDOUT tofu:                           - hosts            = [
01:00:59.505 STDOUT tofu:                               - "auth.tkasolutions.com.br",
01:00:59.505 STDOUT tofu:                             ]
01:00:59.505 STDOUT tofu:                           - ingressClassName = "traefik"
01:00:59.505 STDOUT tofu:                         }
01:00:59.505 STDOUT tofu:                     }
01:00:59.506 STDOUT tofu:                 }
01:00:59.506 STDOUT tofu:             ) -> (known after apply)
01:00:59.506 STDOUT tofu:           ~ version        = "2025.6.1" -> (known after apply)
01:00:59.506 STDOUT tofu:         } -> (known after apply)
01:00:59.506 STDOUT tofu:         name                       = "authentik"
01:00:59.506 STDOUT tofu:       ~ status                     = "failed" -> "deployed"
01:00:59.506 STDOUT tofu:       ~ version                    = "2025.6.1" -> "2025.6.2"
01:00:59.506 STDOUT tofu:         # (25 unchanged attributes hidden)
01:00:59.506 STDOUT tofu:     }
01:00:59.506 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:00:59.506 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/authentik -w terragrunt_kubernetes_authentik
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Fauthentik%252Fterragrunt_kubernetes_authentik)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/authentik -w terragrunt_kubernetes_authentik
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```